---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalOpenings
source: html/d6ce8e10-1ed0-6e28-960b-ce27647ed471.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalOpenings Method

The collection of analytical openings.

## Syntax (C#)
```csharp
public IList<EnergyAnalysisOpening> GetAnalyticalOpenings()
```

## Returns
Returns the analytical openings after model calculation.